app/Controllers/Libros.php

    public function index()
    {
        $data['libros'] = $this->libroModel->findAll();
---
SELECT *
FROM "libro"