app/Models/HomeModel.php

SELECT "genero", SUM(copias_libro) as cantidad_libros
FROM "libro"
GROUP BY "genero"
---
    public function getGeneros()
    {
        return $this->db->table('libro')
            ->select('genero, SUM(copias_libro) as cantidad_libros')
            ->groupBy('genero')
            ->get()
            ->getResult();

SELECT COUNT(*) as prestamos
FROM "prestamo"
WHERE "fecha_hora_entrega" IS NULL
---
    public function getPrestamos()
    {
        return $this->db->table('prestamo')
            ->select('COUNT(*) as prestamos')
            ->where('fecha_hora_entrega IS NULL')
            ->get()
            ->getRow();

SELECT "au"."nombre_autor", COUNT(l.id_libro) as libro
FROM "prestamo" "pe"
JOIN "libro" "l" ON "pe"."id_libro" = "l"."id_libro"
JOIN "autor_libro" "al" ON "l"."id_libro" = "al"."id_libro"
JOIN "autor" "au" ON "al"."id_autor" = "au"."id_autor"
GROUP BY "au"."nombre_autor"
ORDER BY "libro" DESC
 LIMIT 2
---
    public function getAutoresPopulares()
    {
        return $this->db->table('prestamo pe')
            ->select('au.nombre_autor, COUNT(l.id_libro) as libro')
            ->join('libro l', 'pe.id_libro = l.id_libro')
            ->join('autor_libro al', 'l.id_libro = al.id_libro')
            ->join('autor au', 'al.id_autor = au.id_autor')
            ->groupBy('au.nombre_autor')
            ->orderBy('libro', 'DESC')
            ->limit(2)
            ->get()
            ->getResult();

SELECT "nombre_libro", "fecha_publicacion"
FROM "libro"
ORDER BY "fecha_publicacion" ASC
 LIMIT 2
---
    public function getLibrosAntiguos()
    {
        return $this->db->table('libro')
            ->select('nombre_libro, fecha_publicacion')
            ->orderBy('fecha_publicacion', 'ASC')
            ->limit(2)
            ->get()
            ->getResult();

SELECT "l"."nombre_libro", COUNT(pe.id_prestamo) as prestamos
FROM "prestamo" "pe"
INNER JOIN "libro" "l" ON "l"."id_libro" = "pe"."id_libro"
GROUP BY "l"."nombre_libro"
ORDER BY "prestamos" DESC
 LIMIT 2
---
    public function getLibrosMasprestados()
    {
        return $this->db->table('prestamo pe')
            ->select('l.nombre_libro, COUNT(pe.id_prestamo) as prestamos')
            ->join('libro l', 'l.id_libro = pe.id_libro', 'inner')
            ->groupBy('l.nombre_libro')
            ->orderBy('prestamos', 'DESC')
            ->limit(2)
            ->get()
            ->getResult();

SELECT *
FROM "autor"
---
    public function getAutores()
    {
        return $this->db->table('autor')
            ->get()
            ->getResult();