app/Models/LibroModel.php

SELECT "libro"."id_libro", "libro"."nombre_libro", "libro"."genero", "libro"."fecha_publicacion", "libro"."copias_libro", "autor"."nombre_autor"
FROM "libro"
JOIN "autor_libro" ON "autor_libro"."id_libro" = "libro"."id_libro"
JOIN "autor" ON "autor"."id_autor" = "autor_libro"."id_autor"
---
    public function getAllLibros()
    {
        $builder = $this->db->table($this->table);
        $builder->select('libro.id_libro, libro.nombre_libro,libro.genero,libro.fecha_publicacion,libro.copias_libro,autor.nombre_autor');
        $builder->join('autor_libro', 'autor_libro.id_libro = libro.id_libro');
        $builder->join('autor', 'autor.id_autor = autor_libro.id_autor');
        $query = $builder->get();