app/Models/PrestamosModel.php

SELECT "prestamo".*, "usuario"."nombre_usuario", "libro"."nombre_libro"
FROM "prestamo"
JOIN "usuario" ON "prestamo"."id_usuario" = "usuario"."id_usuario"
JOIN "libro" ON "prestamo"."id_libro" = "libro"."id_libro"
---
    public function getPrestamos()
    {
        return $this->select('prestamo.*, usuario.nombre_usuario, libro.nombre_libro')
                    ->join('usuario', 'prestamo.id_usuario = usuario.id_usuario')
                    ->join('libro', 'prestamo.id_libro = libro.id_libro')
                    ->findAll();

INSERT INTO "solicitud_de_prestamo" ("id_usuario", "id_libro") VALUES ('2', '2')
---
    public function insertSolicitud($data)
    {
        return $this->db->table('solicitud_de_prestamo')->insert($data);