app/Models/UsuarioModel.php

    public function obtenerUsuarios()
    {
        $builder = $this->db->table($this->table);
        $builder->select('usuario.id_usuario, usuario.nombre_usuario, usuario.usuario_login,usuario.clave,rol.nombre_rol');
        $builder->join('rol', 'rol.id_rol = usuario.id_rol');
        $builder->orderBy('usuario.id_usuario', 'ASC');
        $query = $builder->get();
---
SELECT *
FROM "usuario"